# SetLineWeights Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DWGImportOptions..::..SetLineWeights Method
DWGImportOptions Class See Also
---
Set array of line weights.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetLineWeights(
	IList<int> lineWeight
)
```

Visual Basic
---
```text
Public Sub SetLineWeights ( _
	lineWeight As IList(Of Integer) _
)
```

Visual C++
---
```text
public:
void SetLineWeights(
	IList<int>^ lineWeight
)
```

# ### Parameters
lineWeight
    Type: System.Collections.Generic..::..IList<(Of <(<'Int32>)>)>
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DWGImportOptions Class
Autodesk.Revit.DB Namespace